{
	"date": "2023-08-15",
	"title": "Camaro has wheels (and so much more)",
	"body": "It's been over a month since my last update, and the Camaro has made a lot of progress. The themes: painting, brakes, suspension, rear end.",
	"media_groups": [
		{
			"media": [
				"tubepaint1.jpeg",
				"tubepaint2.jpeg"
			],
			"caption": "The front end got a paint job. I used an undercoating style black, and had reservations about how it would look before I even started. It certainly does look off. Also, it hasn't set up very nicely, probably due to the heat and humidity in the shop. So I'm considering stripping it and painting it a more typical black this fall."
		},
		{
			"media": [
				"frontbrakes1.jpeg",
				"frontbrakes2.jpeg",
				"frontbrakes3.jpeg"
			],
			"caption": "The front brake kits came in, so I harvested the knuckles off the car's pile of K-member/engine/transmission parts. I'm using the engine hoist in the first picture in order to lift parts arm off the ground so I could get to the knuckle properly. After getting the knuckle and spindle isolated, I had to take them to a machinist to modify for the brakes: the two arms that together make a \"C\" need to be cut off to make room for the calipers."
		},
		{
			"media": [
				"frontbrakes4.jpeg",
				"frontbrakes5.jpeg",
				"frontbrakes6.jpeg",
				"frontbrakes7.jpeg"
			],
			"caption": "The machinist finished, so I got back to assembly. Unfortunately I had to do some undocumented clearanceing of my own, as the coil overs come down too far and interfere with the knuckle. See the third picture for where I had to grind the knuckle down. Pictured is only maybe 70% of the grinding I had to do. Both sides needed this. Finally I loosely installed the entire front end: tubular K member, lower control armms, coil overs, brakes, and hubs. The spring is set really high to get things to sit properly at full droop like this. It has been lowered significantly since."
		},
		{
			"media": [
				"rear1.jpeg",
				"rear2.jpeg"
			],
			"caption": "I've been waiting for months for my rear end kit to finish coming in, and it finally did. The housing was first, then axles, brakes, and finally a month or more afterward the 3rd member showed up. Ford 9\" 3.25. Not pictured is all the other rear suspension stuff I've been ordering that we'll see installed soon."
		},
		{
			"media": [
				"frontcoilover.mp4"
			],
			"caption": "Just a quick note that currently at full droop the front coil overs interfere with the wheel well and (I think) don't allow for full steering. Either we'll cut back the wheel well, or it'll end up not being (much) of a problem. We'll see in the future."
		},
		{
			"media": [
				"tidy.jpeg"
			],
			"caption": "After every time my brother visits to help, I get to clean and tidy the shop. Here's a wide angle view from where my truck is usually parked. It's \"so much better\" than before. I stopped less because there was nothing left to do and more because I was done."
		},
		{
			"media": [
				"engine.jpeg"
			],
			"caption": "We threw the engine in for fun. Really. Wasn't really a reason at this point to install it."
		},
		{
			"media": [
				"rear3.jpeg",
				"rear4.jpeg",
				"rear5.jpeg"
			],
			"caption": "Painting the rear end and its accessories, then a bad shot of everything all installed. Took some paint off that I've since touched up. Here the undercoating black on the rear end makes more sense. While I think it looks better than on the tubular front end, I'm still not sure it's as good as a gloss to match the rest of the rear suspension. But I'm not repainting this guy."
		},
		{
			"media": [
				"done1.jpeg",
				"done2.jpeg",
				"done3.jpeg",
				"done4.jpeg"
			],
			"caption": "Here's how the Camaro sits now (with fewer extra wires). Steering rack (but not connected to the steering wheel). All the wheels and tires that came with it, which I plan to use for everything but racing. Oh, and the front fenders have returned, though they're barely attached. The car can finally roll around again ... just not too quickly as there's no brake lines."
		}
	]
}
