{
	"date": "2023-04-24",
	"title": "The Lift",
	"body": "I bought <a href='https://www.apluslift.com/collections/car-lifts/products/apluslift-ap-10sr-10000lb-2-post-single-release-over-head-car-lift'>a lift</a> for the shop. Getting it home was a huge ordeal because I've never bought and transported something like this before. I thought I had prepared well enough, but I hadn't. I undoubtedly came across as an over-confident noob at the shipping depo. I'm doing my best, I made a mess, and I'm glad I didn't require anyone to help me clean it up.",
	"media_groups": [
		{
			"media": [
				"2-002.jpeg",
				"2-003.jpeg",
				"2-004.jpeg"
			],
			"caption": "April 11th. Making a wooden platform to fill in the center of my car trailer. I understood the lift to come as a 22\"x40\"x113\" package, and with this platform, it could be laid down on its 40\" side and be fully supported for the majority of the length of the lift. This ended up not happening, but I think the platform ended up being imperative to getting the lift home regardless. I again am feeling some regret in buying a trailer from a friend that should really only be used for cars, as opposed to finding a car trailer with a complete solid bottom."
		},
		{
			"media": [
				"1-002.jpeg",
				"1-003.jpeg",
				"1-004.jpeg",
				"1-005.jpeg",
				"1-006.jpeg",
				"1-007.jpeg"
			],
			"caption": "April 19th. Picking up the lift. It was difficult to get on my trailer. I assumed I could have them lay it on its side, but they couldn't, which made my wooden addition basically useless. It sat entirely on one side, I strapped it down \"well,\" and got out of their hair. I didn't get more than a mile away before it slipped off. I pulled into a gas station and spent the next hour and a half coaxing it back onto the trailer with ratchet straps, getting it diagonal with the front on the wood, and strapping it down <i>actually well</i>. It looks really sketchy with the tiny feet basically right on the edge of the back of the trailer, but since I got it strapped down as tight as I possibly could, it never moved during the 120 miles back home. The irremovable bolts coming out of the bottom of the front metal bars made the loading and securing process harder. Luckily I had wood the bolts could dig into so I could properly cinch the front down. Don't get me wrong: even sans-bolts the lift would have fallen off on me. They just made it even more likely."
		},
		{
			"media": [
				"3-002.jpeg",
				"3-003.jpeg",
				"3-004.jpeg",
				"3-005.jpeg"
			],
			"caption": "April 22nd. Assembling the lift. This went extremely smoothly, compared to just getting the thing home. Main hiccup was deforming the threads on one of the anchor bolts while hammering it in, which would cause the nut to get stuck on it and case the bolt to just spin in the hole. After trying and failing to reform them, we finally had an idea that worked. The metal frame that the lift came in has feet and those feet have holes in the bottom. We put a foot of the frame over the bolt, put the nut on as much as we could over that, then used a ratchet strap to pull up on the metal frame. It worked! The threads reformed well enough for us to coax the nut further down onto the bolt and allowed us to torque it to spec (125 ft/lbs, omg). The lift isn't fully finished as of the final picture here. We ran the power cable through conduit the next day, and I have some finishing touches to protect the hydraulic lines and single release cable. "
		}

	]
}
